// 20160304013147
// http://starwars.wikia.com/api/v1/Articles/AsSimpleJson/?id=472920

{
  "sections": [
    {
      "title": "Kylo Ren",
      "level": 1,
      "content": [
        {
          "type": "paragraph",
          "text": "Kylo Ren was a Force-sensitive human male who trained as a Jedi pupil under Jedi Master Luke Skywalker before turning to the dark side of the Force and joining the Knights of Ren. He was born with the name Ben to Princess Leia Organa and the smuggler Han Solo. In his youth, he displayed traits similar to that of his grandfather, Anakin Skywalker, who had turned to the dark side and became the Sith Lord Darth Vader. Ben, who was sent by Organa to be trained by his uncle, fell under the influence of Supreme Leader Snoke of the First Order and destroyed the new generation of Jedi that Luke Skywalker was training. Skywalker vanished, while Ben took the name Kylo Ren and joined the First Order. His goal was to complete what Darth Vader once started and destroy the Jedi."
        },
        {
          "type": "paragraph",
          "text": "Years later, Ren sought the remaining fragment he needed to build a map that would lead to Skywalker's location, so the last Jedi could be destroyed. Ren hunted the astromech droid, BB-8, who carried the map and tracked the droid to Takodana after learning that the droid was in the possession of Han Solo. There, Ren also discovered Rey, a Force-sensitive who had seen the map and was helping BB-8 bring the map to the Resistance. Ren brought Rey to Starkiller Base, a First Order stronghold and superweapon, and attempted to probe her mind for the map information, but she resisted and escaped. The Resistance soon attacked the Starkiller weapon to destroy it, and Ren encountered Solo once again during the battle. He killed his father, hoping to eliminate the light that Ren struggled with inside himself, and tracked Rey and the fugitive stormtrooper Finn to a forest as the Starkiller was under siege. He engaged both in a lightsaber duel, besting Finn before being beaten and injured by Rey. As the Starkiller began to implode from the Resistance attack, Supreme Leader Snoke ordered General Hux, the base's commander, to bring Ren before him so his training could be completed."
        }
      ],
      "images": [
        
      ]
    },
    {
      "title": "Biography",
      "level": 2,
      "content": [
        
      ],
      "images": [
        
      ]
    },
    {
      "title": "Early life",
      "level": 3,
      "content": [
        {
          "type": "paragraph",
          "text": "The son of Leia Organa and Han Solo, Ben was sent to study alongside other Jedi students at a young age, being instructed and led by his uncle, Jedi Master Luke Skywalker. While Ben showed great potential as a Force-user, he began to develop an unhealthy obsession with his grandfather Anakin Skywalker, being inspired by his exploits as the Sith Lord Darth Vader. Feeling that he must uphold the legacy of Vader, Ben betrayed and destroyed his former Jedi peers, preventing Skywalker from fully restoring the Jedi Order. Having fallen under the influence of the mysterious Force-user Snoke, Ben became his apprentice, joining Snoke's First Order and the Knights of Ren, taking on the name Kylo Ren to abandon his former identity. He built his own lightsaber, a dangerous and ragged design, using an unstable kyber crystal, making the blade distorted and crackle unlike that of a typical lightsaber, and started wearing a metal helmet based on designs used by the Knights of Ren. Ren was at the forefront of the First Order's attempts to destroy the Resistance (an organization that opposed the First Order) and the Jedi, with his primary concern being the location and extermination of his former master Luke Skywalker, apparently the only Jedi known to have escaped Ren's uprising."
        }
      ],
      "images": [
        {
          "src": "http://vignette4.wikia.nocookie.net/starwars/images/1/10/KnightsOfRen_TFA.png/revision/latest/scale-to-width-down/250?cb=20160106203901",
          "caption": "Kylo Ren standing with the Knights of Ren, as seen by Rey in a Force vision."
        }
      ]
    },
    {
      "title": "First Order-Resistance conflict",
      "level": 3,
      "content": [
        
      ],
      "images": [
        
      ]
    },
    {
      "title": "Jakku",
      "level": 4,
      "content": [
        {
          "type": "paragraph",
          "text": "The Resistance was also looking for Luke and both sides were after a map that led to his location. The First Order had recovered most of it in the archives of the Empire, but one piece was missing, and the Resistance found it first. Their best pilot, Poe Dameron, was sent to the desert planet Jakku to recover the fragment from Lor San Tekka, but Ren and the First Order were close behind. As the stormtroopers attacked, Dameron hid the map in his droid BB-8, who fled into the desert. Ren had traveled to Jakku personally and laid siege to the small village, executing its leader and the surviving villagers and taking Dameron prisoner. He was taken to the First Order's Star Destroyer Finalizer, where Ren tortured and interrogated the young starfighter pilot for information using the Force, successfully learning about BB-8. The First Order offered a bounty to anyone capable of retrieving the droid and sent a group of troopers to search for it, but lost contact with the defeated group shortly after."
        },
        {
          "type": "paragraph",
          "text": "Shortly after Ren left Dameron alone, a lone stormtrooper chose to desert and free the Resistance pilot and were in the process of fleeing aboard a Special Forces TIE fighter. Ren correctly deduced that the trooper was FN-2187, the stormtrooper who hesitated to fire on the Tuanul villagers. The Finalizer managed to shoot down the rogue TIE with a missile."
        },
        {
          "type": "paragraph",
          "text": "Ren soon discussed the current situation with General Hux, who reminded him that they were to capture BB-8 or destroy it if necessary. Ren in turn criticized Hux for FN-2187's desertion, asserting that perhaps the First Order should resort to using a clone army instead of indoctrinated child soldiers. Hux then warned him not to let his personal interest in Skywalker stand in the way of their orders. Ren ignored him, reminding that he desired the map and insisted that Hux find it."
        },
        {
          "type": "paragraph",
          "text": "An junior officer later reported to Ren that the droid had fled Jakku aboard a certain YT-series Corellian freighter. Ren turned to face the officer, sarcastically asking if the droid stole the freighter by itself. The officer answered that although it was unconfirmed, they believed FN-2187 had a hand on BB-8's escape. Enraged, Ren ignited his lightsaber and took out his anger on an instrument panel. Calming down afterwards, he asked the officer if he had anything else to add. The officer then mentioned that a girl also aided in the escape. Growing more livid, Ren use the Force to pull the officer by his throat across the room in order to choke him with his bare hand, then asks him what girl it was."
        },
        {
          "type": "paragraph",
          "text": "Realizing that he needed help, Ren returned to Starkiller Base, where he sought council with his mentor and leader of the First Order, Supreme Leader Snoke. It was at this time that Snoke told Ren of an awakening he had felt in the Force. The Supreme Leader also said the freighter the droid was on was his father's ship, the Millennium Falcon, and in order for him to overcome the light side of the Force he would need to kill his father. Ren stated that Han meant nothing to him, and that his journey to the dark side would soon be completed."
        },
        {
          "type": "paragraph",
          "text": "News of BB-8's whereabouts soon reached the First Order. This time it had been spotted in a cantina on Takodana."
        }
      ],
      "images": [
        {
          "src": "http://vignette2.wikia.nocookie.net/starwars/images/b/b5/Kylo_tortures_Poe_Dameron.png/revision/latest/scale-to-width-down/250?cb=20151231231227",
          "caption": "Ren interrogates Poe Dameron in an attempt to uncover the location of the map leading to Luke Skywalker's whereabouts."
        }
      ]
    },
    {
      "title": "Capturing Rey",
      "level": 4,
      "content": [
        {
          "type": "paragraph",
          "text": "After arriving on Takodana, the First Order attacked Maz Kanata's castle hoping to find BB-8. Ren searched for the droid in the nearby woods. But instead of finding the last key to Skywalker, he found Rey, a scavenger from Jakku who had helped BB-8 and the former stormtrooper Finn escape the planet. After a brief confrontation, Ren probed her mind and discovered that she had already seen the last part of the map to Skywalker. After rendering Rey unconscious he called back his troops and returned to his shuttle to interrogate her at Starkiller Base."
        },
        {
          "type": "paragraph",
          "text": "Ren waited until a restrained Rey had regained consciousness. When asked what happened to her friends, Ren truly admitted he had no idea. He then remarked that she still desired to kill him. Rey retorted that it was practical when a \"creature in a mask\" was hunting her down, so Ren removed his mask to show his true face. Ren's subsequent interrogation proved to be useless, as Rey was not only able to resist his powers, but she was able to turn his power against him and see visions of what he feared most: that he would never be as powerful as Darth Vader. A distressed Ren returned to Snoke, who was upset that a mere scavenger resisted him. Ren defended that the girl was strong with the Force, albeit untrained, but stronger than even she knew. Snoke then demanded to know what became of BB-8, at which Hux humiliated Ren by revealing that he assumed the droid was unnecessary. Ren insisted that Rey could lead them to Skywalker, so the Supreme Leader ordered his apprentice to bring the girl before him, but she escaped while they talked. Falling into another tantrum, Kylo slashed at her empty restraint chair, scaring away two passing stormtroopers. After calming down, he put the base on high alert, knowing that Rey was only beginning to test her powers and the longer she remained free, the more dangerous she could become."
        }
      ],
      "images": [
        {
          "src": "http://vignette4.wikia.nocookie.net/starwars/images/a/ad/ReyRen-TFAintltrailer.png/revision/latest/scale-to-width-down/250?cb=20151111070637",
          "caption": "Kylo Ren captures Rey following a brief skirmish between the pair on Takodana."
        }
      ]
    },
    {
      "title": "Confrontation with Solo",
      "level": 4,
      "content": [
        {
          "type": "paragraph",
          "text": "While searching for Rey at Starkiller Base, Ren was confronted by his father, Han Solo, who was attempting to destroy the thermal oscillator using explosives with Chewbacca, Finn and Rey. Solo pleaded with Ren to turn his back on the dark side and redeem himself for the choices he had made, offering anything he wanted if he would come back with him. Ren held out his lightsaber, seemingly offering it, but then, in an attempt to overcome the light side of the Force completely, he ignited the lightsaber, plunging it into his father's chest. As the dying Solo looked down in shock, Ren thanked him for giving him what he had wanted. An enraged Chewbacca severely wounded Ren by shooting him in the side with his bowcaster, allowing Finn and Rey time to escape."
        },
        {
          "type": "paragraph",
          "text": "Kylo Ren eventually tracked the pair to a secluded wooded area. After telekinetically seizing Rey and pummeling her into unconsciousness against the base of a large tree, Ren accosted Finn, demanding of the \"traitor\" that he surrender the lightsaber once belonging to Anakin Skywalker. Refusing, Finn ignited the weapon and challenged Kylo to engage him in lightsaber combat; an offer the enraged Kylo seemed only too happy to oblige. Repeatedly striking himself at the blood-soaked site of his earlier injuries in an attempt at drawing upon his anguish to fuel his abilities, Kylo Ren attacked. A short but brutal contest would ensue. Though fighting bravely, Finn would, in the end, prove no match for the dark side powers of Kylo Ren. Ultimately, the dark warrior would overwhelm and disarm his adversary, ending the contest with a vicious lightsaber strike across the back and spine of the former stormtrooper (the result of which would send Finn into a comatose state)."
        },
        {
          "type": "paragraph",
          "text": "With Finn incapacitated, Ren returned his attention to his grandfather's lightsaber, calling upon the Force to draw the weapon to his waiting hand. To Kylo's surprise, a revived Rey intercepted the lightsaber and began to herself engage Ren in a second lightsaber duel. For a time, Kylo would remain on the offensive, pressing the attack against a retreating Rey, the duo felling trees along the way. After eventually locking sabers with Rey, Kylo extended an offer, not to fight, but to train her in the ways of the Force. Upon hearing the name of the Force spoken aloud, Rey became entranced and seemingly empowered. Though ostensibly being the only one of the pair formally trained in lightsaber combat, Ren was put on the defensive and eventually disarmed by Rey, receiving a significant facial wound in the process."
        },
        {
          "type": "paragraph",
          "text": "Before Rey was able to attempt a finishing strike, Starkiller Base's surface began to break apart. As the planet began to crumble around them, Rey and Finn were rescued by Chewbacca in the Millennium Falcon. Wounded but alive, Kylo Ren escaped the destruction of the base with the support of General Hux and his First Order forces."
        }
      ],
      "images": [
        {
          "src": "http://vignette2.wikia.nocookie.net/starwars/images/e/e1/Kylo_Ren_confronts_Rey_and_Finn.png/revision/latest/scale-to-width-down/250?cb=20160122052345",
          "caption": "Kylo Ren confronts Finn and Rey during the Battle of Starkiller Base."
        }
      ]
    },
    {
      "title": "Personality and traits",
      "level": 2,
      "content": [
        {
          "type": "paragraph",
          "text": "Kylo Ren was a male human, born \"Ben\" to father, Han Solo, and mother, Leia Organa, and heir to the powerful Skywalker lineage of Force users. As Kylo Ren, he wore a black hood and cloak, a dark mask, and wielded a dangerous and unstable lightsaber Kylo had personally constructed. Ren wore a mask and helmet that altered his voice much like Darth Vader, his idol. However, unlike Vader, who needed a mask to keep him alive and hide a severely burned physique, Ren did not physically require the use of a mask.His lightsaber, based on an ancient design dating back to the Great Scourge of Malachor, relied upon a cracked kyber crystal that could barely contain the power of the weapon, necessitating the lateral plasma vents that produced its signature crossguard quillons. The fractured crystal was also responsible for the unstable, serrated appearance of the weapon's red plasma blades. The crossguard exhaust ports were also useful in combat, as witnessed when Kylo pushed his way through a saber lock he had held with Finn, before using the vent's emissions to burn into the shoulder of his opponent."
        },
        {
          "type": "paragraph",
          "text": "Ren was obsessed with his ancestral connection to the legendary and powerful Sith Lord, Darth Vader. Believing himself capable of communicating with his deceased grandfather, Ren implored the spirit of Vader to \"Show me again the power of the darkness, and I'll let nothing stand in our way. Show me, grandfather, and I will finish what you started.” When questioning Rey at Starkiller Base, Rey accused Kylo of fearing that he would never be as strong as Darth Vader—much to the chagrin of Ren. The dark warrior was also known for his fiery temper, but compared to Vader, Ren had less control over his own anger. Met with adversity, he would throw dramatic tantrums where he might lash out with his lightsaber at anything within sight, devastating equipment simply to express his frustration. If they could, stormtroopers preferred to stay far away from the mentally unstable Kylo Ren when he was in that mood."
        },
        {
          "type": "paragraph",
          "text": "Ren was encouraged by Snoke to honor the heritage of both the light side and the dark side, and due to this demonstrated deep conflict within himself. He constantly felt the pull of the light and his family, and struggled to keep himself disconnected from his former life, similar to his grandfather before him. Snoke believed Ren to be an ideal embodiment of the Force: a focal point of both the dark and the light side."
        }
      ],
      "images": [
        {
          "src": "http://vignette1.wikia.nocookie.net/starwars/images/7/79/Kylo_Ren_Vader_Helmet_Chamber.jpg/revision/latest/scale-to-width-down/250?cb=20151221022506",
          "caption": "Kylo Ren idolized his grandfather; not as Anakin Skywalker, but rather Darth Vader."
        }
      ]
    },
    {
      "title": "Powers and abilities",
      "level": 2,
      "content": [
        {
          "type": "paragraph",
          "text": "Like his grandfather, uncle, and mother, Kylo Ren possessed a powerful connection to the Force. He was skilled in the use of telekinesis, able to use it to immobilize beings, stop and hold blaster bolts in mid-air for an extended period of time, and send individuals soaring with a Force push. Kylo was able to both telepathically torture individuals (as witnessed in Ren's interrogation of Resistance pilot Poe Dameron), and use the power of a mind probe to telepathically extract information from his victims. Ren was also able to discern disturbances in the Force, sensing an awakening in the Force and intuiting the presence of Han Solo at Starkiller Base. Kylo Ren demonstrated a high degree of proficiency in the use of a lightsaber, utilizing the weapon both to successfully defend against incoming enemy fire and to engage armed opponents in one-to-one lightsaber combat. Additionally, Kylo possessed considerable stamina, will power and a high threshold for pain tolerance, with Ren able to continue to battle multiple opponents despite being severely wounded in the side by fire from a bowcaster and receiving lesser injuries from both Finn and Rey during the course of their respective conflicts."
        }
      ],
      "images": [
        {
          "src": "http://vignette2.wikia.nocookie.net/starwars/images/1/16/KyloIsNotKyboRen-TFAT2-4KPub.jpg/revision/latest/scale-to-width-down/250?cb=20150418182416",
          "caption": "Kylo Ren uses the Force to suspend incoming blaster fire in mid-air."
        }
      ]
    },
    {
      "title": "Behind the scenes",
      "level": 2,
      "content": [
        {
          "type": "paragraph",
          "text": "Kylo Ren was first revealed in the first teaser trailer for Star Wars: Episode VII The Force Awakens on November 28, 2014. Ren's name was revealed by Entertainment Weekly in an exclusive trading card. He also appeared in the second teaser trailer, and will appear on all The Force Awakens merchandise. On May 4, 2015, it was confirmed by video footage released by Vanity Fair that Kylo Ren is portrayed by Adam Driver."
        },
        {
          "type": "paragraph",
          "text": "Michael Arndt stated Kylo Ren's backstory came about from needing a rationale for the original trilogy's main characters to have separated after Return of the Jedi. J.J. Abrams wanted The Force Awakens to tap into parental fears of a child gone wrong with Kylo Ren. He also wanted the film to tell the story of someone who was still becoming a villain, and that they needed to be bold with the character. \"The only reason why Kylo Ren has any hope of being a worthy successor [to Darth Vader] is because we lose one of the most beloved characters,\" he explained, later adding \"There's nothing I could think of that is more hideous than patricide, especially when it comes to Han Solo.\""
        },
        {
          "type": "paragraph",
          "text": "The scene with Darth Vader's helmet in The Force Awakens was the originally scripted reveal of Kylo Ren's ancestry. It was meant to happen after Finn and Poe's escape, with the context being Ren blaming himself for not having done anything about FN-2187 seeing the light. However, editors Mary Jo Markey and Maryann Brandon felt it came too early and decided it was a waste of a good moment, so they moved it later into the film to foreshadow Han's death instead."
        },
        {
          "type": "paragraph",
          "text": "A similar character, Jacen Solo, appeared in the continuity of Star Wars Legends. Like Kylo Ren, Jacen was the son of Han Solo and Leia Organa who was trained as a Jedi by Luke Skywalker, only to turn to the dark side and take a new name, Darth Caedus. A villainous character named Kybo Ren appeared in the 1985 Star Wars: Droids animated series."
        },
        {
          "type": "paragraph",
          "text": "On Saturday, January 16, 2016, Adam Driver hosted an installment of the hit sketch comedy series Saturday Night Live and appeared in-character as Ren in a sketch. The sketch, which opens with clips from Star Wars: The Force Awakens, features the character in a take on the reality series Undercover Boss, posing as \"Matt,\" a radar technician taking a behind-the-scenes look at operations on Starkiller Base. \"Matt\" meets with individuals working on the base, such as a First Order officer whose son was a stormtrooper that he killed, but has trouble maintaining the charade due to his lack of emotional control."
        }
      ],
      "images": [
        {
          "src": "http://vignette2.wikia.nocookie.net/starwars/images/b/b9/KyloRenMural-Fathead.png/revision/latest/scale-to-width-down/200?cb=20150914015416",
          "caption": "Promotional image featuring Kylo Ren in a battle-ready stance."
        },
        {
          "src": "http://vignette3.wikia.nocookie.net/starwars/images/1/1c/Matt_the_Radar_Technician.png/revision/latest/scale-to-width-down/200?cb=20160206214938",
          "caption": "Kylo Ren posing as \"Matt\" in the Saturday Night Live skit"
        }
      ]
    },
    {
      "title": "Appearances",
      "level": 2,
      "content": [
        {
          "type": "list",
          "elements": [
            {
              "text": "Before the Awakening",
              "elements": [
                
              ]
            },
            {
              "text": "Star Wars: Episode VII The Force Awakens",
              "elements": [
                
              ]
            },
            {
              "text": "Star Wars: Episode VII The Force Awakens novelization",
              "elements": [
                
              ]
            },
            {
              "text": "Star Wars: Episode VII The Force Awakens junior novelization",
              "elements": [
                
              ]
            },
            {
              "text": "The Force Awakens storybook",
              "elements": [
                
              ]
            },
            {
              "text": "Lightsaber Rescue",
              "elements": [
                
              ]
            },
            {
              "text": "Star Wars: Episode VIII",
              "elements": [
                
              ]
            }
          ]
        }
      ],
      "images": [
        
      ]
    },
    {
      "title": "Non-canon appearances",
      "level": 3,
      "content": [
        {
          "type": "list",
          "elements": [
            {
              "text": "Disney Infinity 3.0",
              "elements": [
                
              ]
            },
            {
              "text": "Star Wars: Galaxy of Heroes",
              "elements": [
                
              ]
            },
            {
              "text": "LEGO Star Wars: The Force Awakens",
              "elements": [
                
              ]
            },
            {
              "text": "LEGO Star Wars: The Resistance Rises",
              "elements": [
                
              ]
            }
          ]
        }
      ],
      "images": [
        
      ]
    },
    {
      "title": "Sources",
      "level": 2,
      "content": [
        {
          "type": "list",
          "elements": [
            {
              "text": "Star Wars: The Force Awakens Official Teaser Trailer on the official Star Wars YouTube Channel",
              "elements": [
                
              ]
            },
            {
              "text": " Star Wars: Episode VII The Force Awakens on StarWars.com",
              "elements": [
                
              ]
            },
            {
              "text": " Star Wars: The Force Awakens Digital Trading Cards on StarWars.com",
              "elements": [
                
              ]
            },
            {
              "text": "\"Launch Pad\"—Star Wars Insider 155",
              "elements": [
                
              ]
            },
            {
              "text": "Star Wars: Card Trader",
              "elements": [
                
              ]
            },
            {
              "text": "Star Wars: The Force Awakens Official Teaser #2 on the official Star Wars YouTube Channel",
              "elements": [
                
              ]
            },
            {
              "text": "\"Launch Pad\"—Star Wars Insider 158",
              "elements": [
                
              ]
            },
            {
              "text": " Star Wars: The Force Awakens Products to Arrive on 'Force Friday,' September 4 on StarWars.com",
              "elements": [
                
              ]
            },
            {
              "text": "LEGO Star Wars Episode VII: The Force Awakens",
              "elements": [
                
              ]
            },
            {
              "text": "Star Wars: Absolutely Everything You Need to Know",
              "elements": [
                
              ]
            },
            {
              "text": "\"Bantha Tracks\"—Star Wars Insider 160",
              "elements": [
                
              ]
            },
            {
              "text": "\"Blaster\"—Star Wars Insider 161",
              "elements": [
                
              ]
            },
            {
              "text": "Star Wars: The Force Awakens Official Trailer on the official Star Wars YouTube Channel",
              "elements": [
                
              ]
            },
            {
              "text": "Star Wars: The Force Awakens: The Visual Dictionary",
              "elements": [
                
              ]
            },
            {
              "text": "\"Adam Driver Is Kylo Ren\"—Star Wars Insider 162",
              "elements": [
                
              ]
            },
            {
              "text": " Kylo Ren in the Databank",
              "elements": [
                
              ]
            },
            {
              "text": " Kylo Ren's Command Shuttle in the Databank",
              "elements": [
                
              ]
            }
          ]
        }
      ],
      "images": [
        
      ]
    },
    {
      "title": "External links",
      "level": 2,
      "content": [
        {
          "type": "list",
          "elements": [
            {
              "text": "Kylo Ren on Wikipedia",
              "elements": [
                
              ]
            }
          ]
        }
      ],
      "images": [
        
      ]
    }
  ]
}